DDam_OverInterDyMFoam/CASE10/backgroundAndMovingObject/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 80;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    walls
    {
        type            omegaWallFunction;
        inletValue      $internalField;
        value           $internalField;
    }
    
    bed1
    {
        type            omegaWallFunction;
        inletValue      $internalField;
        value           $internalField;
    }
    
    bed2
    {
        type            omegaWallFunction;
        inletValue      $internalField;
        value           $internalField;
    }

    top
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    
    movingObject
    {
        type            omegaWallFunction;
        inletValue      $internalField;
        value           $internalField;
    }
    
    oversetPatch1
    {
        type           overset;
    }

}

// ************************************************************************* //
