DDam_OverInterDyMFoam/CASE10/backgroundAndMovingObject/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    ( 0.00 0.00 -0.60)	//0
    ( 0.29 0.00 -0.60)	//1
    ( 2.04 0.00 -0.60)	//2
    ( 5.38 0.00 -0.60)	//3
    (10.78 0.00  0.18)	//4
    (10.78 0.58  0.18)	//5
    ( 5.38 0.58 -0.60)	//6
    ( 2.04 0.58 -0.60)	//7
    ( 0.29 0.58 -0.60)	//8
    ( 0.00 0.58 -0.60)	//9
    ( 0.00 0.00  0.52)	//10
    ( 0.29 0.00  0.52)	//11
    ( 2.04 0.00  0.52)	//12
    ( 5.38 0.00  0.52)	//13
    (10.78 0.00  1.30)	//14
    (10.78 0.58  1.30)	//15
    ( 5.38 0.58  0.52)	//16
    ( 2.04 0.58  0.52)	//17
    ( 0.29 0.58  0.52)	//18
    ( 0.00 0.58  0.52)	//19
);

blocks
(
    hex ( 0  1  8  9 10 11 18 19) ( 42 1 160) simpleGrading (1 1 1)
    hex ( 1  2  7  8 11 12 17 18) (250 1 160) simpleGrading (1 1 1)
    hex ( 2  3  6  7 12 13 16 17) (480 1 160) simpleGrading (1 1 1)
    hex ( 3  4  5  6 13 14 15 16) (771 1 160) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    oversetPatch
    {
        type overset;
        faces ();
    }

    frontAndbackBackground
    {
        type empty;
        faces
        (
            ( 0  1 11 10)
            ( 1  2 12 11)
            ( 2  3 13 12)
            ( 3  4 14 13)
            ( 9 19 18  8)
            ( 8 18 17  7)
            ( 7 17 16  6)
            ( 6 16 15  5)
        );
    }
    walls
    {
        type wall;
        faces
        (
            ( 0 10 19 9)
            ( 5 15 14 4)
        );
    }
    
    bed1
    {
        type wall;
        faces
        (
            ( 0  9  8 1)
            ( 1  8  7 2)
            ( 2  7  6 3)
        );
    }
    
    bed2
    {
        type wall;
        faces
        (
            ( 3  6  5 4)
        );
    }

    top
    {
        type patch;
        faces
        (
            (10 11 18 19)
            (11 12 17 18)
            (12 13 16 17)
            (13 14 15 16)
        );
    }
);
mergePatchPairs
(
);

// ************************************************************************* //
